app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]

      @songs = Artist.find_by_artist_id:
    else
      @songs = Song.all