app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
---
  def index
    if params[:artist_id]

      @songs = Artist.find_by_artist_id:
    else
      @songs = Song.all